{
  "movies": [
    {
      "id": 1,
      "name": "The Shawshank Redemption",
      "rating": 9.3,
      "overview": "Framed in the 1940s for the double murder of his wife and her lover, upstanding banker Andy Dufresne begins a new life at the Shawshank prison, where he puts his accounting skills to work for an amoral warden. During his long stretch in prison, Dufresne comes to be admired by the other inmates -- including an older prisoner named Red -- for his integrity and unquenchable sense of hope.",
      "imgURL": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/q6y0Go1tsGEsmtFryDOJo3dEmqu.jpg"
    },
    {
      "id": 2,
      "name": "Spider-Man: No Way Home ",
      "rating": 7.6,
      "overview": "Peter Parker is unmasked and no longer able to separate his normal life from the high-stakes of being a super-hero. When he asks for help from Doctor Strange the stakes become even more dangerous, forcing him to discover what it truly means to be Spider-Man.",
      "imgURL": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/1g0dhYtq4irTY1GPXvft6k4YLjm.jpg"
    },
    {
      "id": 3,
      "name": "Uncharted",
      "rating": 9,
      "overview": "A young street-smart, Nathan Drake and his wisecracking partner Victor “Sully” Sullivan embark on a dangerous pursuit of “the greatest treasure never found” while also tracking clues that may lead to Nathan’s long-lost brother.",
      "imgURL": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/tlZpSxYuBRoVJBOpUrPdQe9FmFq.jpg"
    },
    {
      "id": 4,
      "name": "Thor: Ragnarok",
      "rating": 8.7,
      "overview": "Thor is imprisoned on the other side of the universe and finds himself in a race against time to get back to Asgard to stop Ragnarok, the destruction of his home-world and the end of Asgardian civilization, at the hands of a powerful new threat, the ruthless Hela.",
      "imgURL": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/rzRwTcFvttcN1ZpX2xv4j3tSdJu.jpg"
    },
    {
      "id": 5,
      "name": "Jurassic World Dominionv",
      "rating": 7.7,
      "overview": "Four years after Isla Nublar was destroyed, dinosaurs now live—and hunt—alongside humans all over the world. This fragile balance will reshape the future and determine, once and for all, whether human beings are to remain the apex predators on a planet they now share with history’s most fearsome creatures.",
      "imgURL": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/kAVRgw7GgK1CfYEJq8ME6EvRIgU.jpg"
    },
    {
      "id": 6,
      "name": "Avengers: Infinity War ",
      "rating": 8.9,
      "overview": "As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment - the fate of Earth and existence itself has never been more uncertain.",
      "imgURL": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/7WsyChQLEftFiDOVTGkv3hFpyyt.jpg"
    },
    {
      "id": 7,
      "name": "Baby Driver",
      "rating": 8.2,
      "overview": "After being coerced into working for a crime boss, a young getaway driver finds himself taking part in a heist doomed to fail.",
      "imgURL": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/rmnQ9jKW72bHu8uKlMjPIb2VLMI.jpg"
    },
    {
      "id": 8,
      "name": "Kingsman: The Golden Circle ",
      "rating": 7.3,
      "overview": "When an attack on the Kingsman headquarters takes place and a new villain rises, Eggsy and Merlin are forced to work together with the American agency known as the Statesman to save the world.",
      "imgURL": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/34xBL6BXNYFqtHO9zhcgoakS4aP.jpg"
    },
    {
      "id": 9,
      "name": "Jumanji: Welcome to the Jungle",
      "rating": 7,
      "overview": "The tables are turned as four teenagers are sucked into Jumanji's world - pitted against rhinos, black mambas and an endless variety of jungle traps and puzzles. To survive, they'll play as characters from the game.",
      "imgURL": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/pSgXKPU5h6U89ipF7HBYajvYt7j.jpg"
    },
    {
      "id": 10,
      "name": "Pirates of the Caribbean: The Curse of the Black Pearl ",
      "rating": 8.9,
      "overview": "Jack Sparrow, a freewheeling 18th-century pirate, quarrels with a rival pirate bent on pillaging Port Royal. When the governor's daughter is kidnapped, Sparrow decides to help the girl's love save her.",
      "imgURL": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/z8onk7LV9Mmw6zKz4hT6pzzvmvl.jpg"
    },
    {
      "name": "Spy x Family",
      "rating": "8.6",
      "imgURL": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/wJOLiZIDvtmNbOaaHxQrRGzCAEu.jpg",
      "overview": "Westalis isimli ülke adına çalışan ve kod adı \"Alacakaranlık\" olan bir casus, komşu ülke Ostania ile aradaki sürtüşmeyi durdurmak ve barışı sağlamak adına bir görev almıştır. Aldığı bu görevde Alacakaranlık, Ostanialı bir politikacı olan Donovan Desmond'a yakınlaşmak mecburiyetindedir ve bu görevi başarabilmek için sahte bir aile kurmak zorundadır. Yetimhaneden sahipleneceği Anya ve \"Dikenli Prenses\" olarak bilinen Yor ile tanışıp bir yuva kuracaklardır.",
      "id": 13
    }
  ]
}